Revit 2024 API
ParameterFilterRuleFactory.CreateHasNoValueParameterRule Method
 Creates a filter rule that determines whether an element's parameter does not have a value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public static FilterRule CreateHasNoValueParameterRule(
	ElementId parameter
)
Visual Basic
Public Shared Function CreateHasNoValueParameterRule ( _
	parameter As ElementId _
) As FilterRule
Visual C++
public:
static FilterRule^ CreateHasNoValueParameterRule(
	ElementId^ parameter
)
Parameters
parameter
Type: Autodesk.Revit.DB.ElementId
 The parameter to be evaluated by the filter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace